<a href="https://colab.research.google.com/github/agrawalsajal02/MachineLearning/blob/master/cnn/artificial_neural_networks_(krish_naik).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

In [0]:
import numpy as np

In [0]:
import matplotlib.pyplot as plt

In [0]:
dataset=pd.read_csv("/content/Churn_Modelling.csv")

In [17]:
dataset

      RowNumber  CustomerId    Surname  ...  IsActiveMember EstimatedSalary Exited
0             1    15634602   Hargrave  ...               1       101348.88      1
1             2    15647311       Hill  ...               1       112542.58      0
2             3    15619304       Onio  ...               0       113931.57      1
3             4    15701354       Boni  ...               0        93826.63      0
4             5    15737888   Mitchell  ...               1        79084.10      0
...         ...         ...        ...  ...             ...             ...    ...
9995       9996    15606229   Obijiaku  ...               0        96270.64      0
9996       9997    15569892  Johnstone  ...               1       101699.77      0
9997       9998    15584532        Liu  ...               1        42085.58      1
9998       9999    15682355  Sabbatini  ...               0        92888.52      1
9999      10000    15628319     Walker  ...               0        38190.78      0

[10000 rows x 14 columns]

In [18]:
print(dataset.head())

   RowNumber  CustomerId   Surname  ...  IsActiveMember EstimatedSalary Exited
0          1    15634602  Hargrave  ...               1       101348.88      1
1          2    15647311      Hill  ...               1       112542.58      0
2          3    15619304      Onio  ...               0       113931.57      1
3          4    15701354      Boni  ...               0        93826.63      0
4          5    15737888  Mitchell  ...               1        79084.10      0

[5 rows x 14 columns]

In [0]:
x=dataset.iloc[:,3:13]

In [0]:
y=dataset.iloc[:,13]

In [21]:
x

      CreditScore Geography  Gender  ...  HasCrCard  IsActiveMember  EstimatedSalary
0             619    France  Female  ...          1               1        101348.88
1             608     Spain  Female  ...          0               1        112542.58
2             502    France  Female  ...          1               0        113931.57
3             699    France  Female  ...          0               0         93826.63
4             850     Spain  Female  ...          1               1         79084.10
...           ...       ...     ...  ...        ...             ...              ...
9995          771    France    Male  ...          1               0         96270.64
9996          516    France    Male  ...          1               1        101699.77
9997          709    France  Female  ...          0               1         42085.58
9998          772   Germany    Male  ...          1               0         92888.52
9999          792    France  Female  ...          1               0         38190.78

[10000 rows x 10 columns]

In [22]:
y

0       1
1       0
2       1
3       0
4       0
       ..
9995    0
9996    0
9997    1
9998    1
9999    0
Name: Exited, Length: 10000, dtype: int64

In [0]:
geography=pd.get_dummies(x["Geography"],drop_first=True)

In [24]:
geography

      Germany  Spain
0           0      0
1           0      1
2           0      0
3           0      0
4           0      1
...       ...    ...
9995        0      0
9996        0      0
9997        0      0
9998        1      0
9999        0      0

[10000 rows x 2 columns]

In [0]:
gender=pd.get_dummies(x["Gender"],drop_first=True)

In [0]:
x=pd.concat([x,geography,gender],axis=1)

In [27]:
x

      CreditScore Geography  Gender  Age  ...  EstimatedSalary  Germany  Spain  Male
0             619    France  Female   42  ...        101348.88        0      0     0
1             608     Spain  Female   41  ...        112542.58        0      1     0
2             502    France  Female   42  ...        113931.57        0      0     0
3             699    France  Female   39  ...         93826.63        0      0     0
4             850     Spain  Female   43  ...         79084.10        0      1     0
...           ...       ...     ...  ...  ...              ...      ...    ...   ...
9995          771    France    Male   39  ...         96270.64        0      0     1
9996          516    France    Male   35  ...        101699.77        0      0     1
9997          709    France  Female   36  ...         42085.58        0      0     0
9998          772   Germany    Male   42  ...         92888.52        1      0     1
9999          792    France  Female   28  ...         38190.78        0      0     0

[10000 rows x 13 columns]

In [0]:
x=x.drop(["Geography","Gender"],axis=1)

In [29]:
x

      CreditScore  Age  Tenure  ...  Germany  Spain  Male
0             619   42       2  ...        0      0     0
1             608   41       1  ...        0      1     0
2             502   42       8  ...        0      0     0
3             699   39       1  ...        0      0     0
4             850   43       2  ...        0      1     0
...           ...  ...     ...  ...      ...    ...   ...
9995          771   39       5  ...        0      0     1
9996          516   35      10  ...        0      0     1
9997          709   36       7  ...        0      0     0
9998          772   42       3  ...        1      0     1
9999          792   28       4  ...        0      0     0

[10000 rows x 11 columns]

In [0]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2,random_state=0)

In [31]:
x_test

      CreditScore  Age  Tenure  ...  Germany  Spain  Male
9394          597   35       8  ...        1      0     0
898           523   40       2  ...        0      0     0
2398          706   42       8  ...        0      1     0
5906          788   32       4  ...        0      0     1
2343          706   38       5  ...        1      0     1
...           ...  ...     ...  ...      ...    ...   ...
1037          625   24       1  ...        0      0     0
2899          586   35       7  ...        0      0     0
9549          578   36       1  ...        0      1     1
2740          650   34       4  ...        1      0     1
6690          573   30       8  ...        1      0     1

[2000 rows x 11 columns]

In [0]:
#
#you require feature scaling even in deep newural network

In [0]:
from sklearn.preprocessing import StandardScaler
sc=StandardScaler()
x_train=sc.fit_transform(x_train)
x_test=sc.transform(x_test)

In [34]:
x_train

array([[ 0.16958176, -0.46460796,  0.00666099, ..., -0.5698444 ,
         1.74309049, -1.09168714],
       [-2.30455945,  0.30102557, -1.37744033, ...,  1.75486502,
        -0.57369368,  0.91601335],
       [-1.19119591, -0.94312892, -1.031415  , ..., -0.5698444 ,
        -0.57369368, -1.09168714],
       ...,
       [ 0.9015152 , -0.36890377,  0.00666099, ..., -0.5698444 ,
        -0.57369368,  0.91601335],
       [-0.62420521, -0.08179119,  1.39076231, ..., -0.5698444 ,
         1.74309049, -1.09168714],
       [-0.28401079,  0.87525072, -1.37744033, ...,  1.75486502,
        -0.57369368, -1.09168714]])

In [35]:
import keras
from keras.models import Sequential
from keras.layers import Dense
from keras.layers import LeakyReLU,PReLU,ELU
from keras.layers import Dropout

Using TensorFlow backend.

In [0]:
model=Sequential()

In [0]:
model.add(Dense(units=6,kernel_initializer="he_uniform",activation="relu",input_dim=11))

In [98]:
model.add(Dropout(0.3))

WARNING:tensorflow:From /usr/local/lib/python3.6/dist-packages/keras/backend/tensorflow_backend.py:148: The name tf.placeholder_with_default is deprecated. Please use tf.compat.v1.placeholder_with_default instead.

WARNING:tensorflow:From /usr/local/lib/python3.6/dist-packages/keras/backend/tensorflow_backend.py:3733: calling dropout (from tensorflow.python.ops.nn_ops) with keep_prob is deprecated and will be removed in a future version.
Instructions for updating:
Please use `rate` instead of `keep_prob`. Rate should be set to `rate = 1 - keep_prob`.

In [0]:
model.add(Dense(units=6,kernel_initializer="he_uniform",activation="relu"))

In [0]:
model.add(Dropout(0.3))

In [101]:
model.add(Dense(output_dim=1,kernel_initializer="glorot_uniform",activation="sigmoid"))

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: UserWarning: Update your `Dense` call to the Keras 2 API: `Dense(kernel_initializer="glorot_uniform", activation="sigmoid", units=1)`
  """Entry point for launching an IPython kernel.

In [0]:
model.compile(optimizer="Adamax",loss="binary_crossentropy",metrics=["accuracy"])

In [103]:
model.summary()

Model: "sequential_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_14 (Dense)             (None, 6)                 72
_________________________________________________________________
dropout_1 (Dropout)          (None, 6)                 0
_________________________________________________________________
dense_15 (Dense)             (None, 6)                 42
_________________________________________________________________
dropout_2 (Dropout)          (None, 6)                 0
_________________________________________________________________
dense_16 (Dense)             (None, 1)                 7
=================================================================
Total params: 121
Trainable params: 121
Non-trainable params: 0
_________________________________________________________________

In [104]:
model_history=model.fit(x_train,y_train,validation_split=0.33,batch_size=10,nb_epoch=10)

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: UserWarning: The `nb_epoch` argument in `fit` has been renamed `epochs`.
  """Entry point for launching an IPython kernel.

Train on 5359 samples, validate on 2641 samples
Epoch 1/10
5359/5359 [==============================] - 3s 500us/step - loss: 0.6450 - acc: 0.6908 - val_loss: 0.5109 - val_acc: 0.7963
Epoch 2/10
5359/5359 [==============================] - 2s 400us/step - loss: 0.5535 - acc: 0.7776 - val_loss: 0.4891 - val_acc: 0.7955
Epoch 3/10
5359/5359 [==============================] - 2s 388us/step - loss: 0.5188 - acc: 0.7912 - val_loss: 0.4825 - val_acc: 0.7955
Epoch 4/10
5359/5359 [==============================] - 2s 422us/step - loss: 0.5094 - acc: 0.7927 - val_loss: 0.4768 - val_acc: 0.7955
Epoch 5/10
5359/5359 [==============================] - 2s 432us/step - loss: 0.4997 - acc: 0.7964 - val_loss: 0.4721 - val_acc: 0.7955
Epoch 6/10
5359/5359 [==============================] - 2s 449us/step - loss: 0.4925 - acc: 0.7944 - val_loss: 0.4689 - val_acc: 0.7955
Epoch 7/10
5359/5359 [==============================] - 2s 442us/step - loss: 0.4858 - acc: 0.7975 - val_loss: 0.4657 - val_acc: 0.7955
Epoch 8/10
5359/5359 [==============================] - 2s 408us/step - loss: 0.4796 - acc: 0.7972 - val_loss: 0.4612 - val_acc: 0.7955
Epoch 9/10
5359/5359 [==============================] - 2s 388us/step - loss: 0.4754 - acc: 0.7975 - val_loss: 0.4582 - val_acc: 0.7955
Epoch 10/10
5359/5359 [==============================] - 2s 407us/step - loss: 0.4719 - acc: 0.8001 - val_loss: 0.4552 - val_acc: 0.7955

In [0]:
from sklearn.metrics import classification_report

In [0]:
y_pre=model.predict(x_test)
y_pred=y_pre>0.5

In [94]:
from sklearn.metrics import confusion_matrix
print(confusion_matrix(y_test,y_pred))

[[1503   92]
 [ 217  188]]

In [95]:
print(classification_report(y_test,y_pred))

              precision    recall  f1-score   support

           0       0.87      0.94      0.91      1595
           1       0.67      0.46      0.55       405

    accuracy                           0.85      2000
   macro avg       0.77      0.70      0.73      2000
weighted avg       0.83      0.85      0.83      2000